"""
С клавиатуры в отдельных строках вводятся целые числа a и b. Напишите программу, которая вычислит их сумму и выведет её на экран.
"""
a = int(input())
b = int(input())
print (a + b)