"""
Даны два числа. Выведите порядковый номер меньшего из них.



Формат входных данных
Вводятся два целых числа a, b.

Формат выходных данных
Требуется вывести порядковый номер меньшего из них.
"""
a = int(input())
b = int(input())

if(a>b):
    print(2)
else:
    print(1)