"""
Известно, что 1 удав по длине равен 38 попугаям. Но мало кто знает, что 1 попугай, это 26 червяков. Дано A попугаев. Сколько в них червяков?

Формат входных данных
На вход программы подается целое число А.

Формат выходных данных
Требуется вывести целое число – количество червяков.
"""

a = int(input())
print(a*26)