"""
N
 школьников делят K
 яблок поровну, неделящийся остаток остается в корзинке. Сколько яблок достанется каждому школьнику?

Формат входных данных
Программа получает на вход два целых числа – N
 школьников и K
 яблок.

Формат выходных данных
Требуется вывести одно число – количество яблок, которое достанется каждому школьнику.
"""
a = int(input())
b = int(input())
print(b // a)