"""
Итак, мы научились использовать переменные для простого вывода.

А что, если кто-то создал переменные за нас?

В таком случае нам остаётся только одно – понять, как их использовать для получения правильного ответа!

Формат выходных данных
Одно целое число – ответ на задачу.

Используй данные в задаче переменные для получения правильного ответа.

Примечания
В этой задаче есть преамбула – это специальная заготовка кода.
Так что перед тем, как приступить к решению, зайди внутрь задачи и скопируй заготовку себе в IDE.
"""
a = 8
b = 7
c = 11
d = 13
print(c+d)