"""
Это уже третья версия задачи "A + B" (я надеюсь, ты следишь за их общим развитием). Теперь будем действовать серьёзно.

Тебе необходимо считать два целых числа и вывести их сумму.

Формат входных данных
Два целых числа, каждое на отдельной строчке.

Формат выходных данных
Сумма двух данных чисел.
"""

a = input()
b = input()

print(int(a) + int(b))