"""
Ты мог слышать шутку, к которой отсылает название, но на самом деле это полуотсылка – мы действительно собираемся делить землекопов.
Только для большей гуманности будем считать, что делим составное устройство "Землекоп3000" между специальными отделами.

Тебе будет дано количество составных устройств и количество отделов. Нужно понять, сколько устройств дойдёт до каждого отдела (спойлер – это может быть не целое число).

Формат входных данных
Два целых числа, каждое на отдельной строчке.
Первое – количество устройств, второе – количество отделов.

Формат выходных данных
Число, являющееся ответом на задачу.
"""

a = input()
b = input()

print(int(a) / int(b))