"""
Хорошо, клеить числа мы теперь умеем.
Но наша программа как простая машина просто что-то делает, холодно и расчётливо.
Давай добавим ей человечности?

Пользователь будет вводить своё имя, а программа будет с ним здороваться!

Формат входных данных
Имя без пробелов на одной строке.

Формат выходных данных
Фраза "Здравствуй, " + имя, которое ввёл пользователь.
"""
a = input()
print("Здравствуй, ",a )