"""
Нам дали власть – мы теперь можем считывать ввод от пользователя.
Самое время посмотреть на первую задачу данного блока под новым углом.

Вот только пока что не нужно приводить введённые числа к числам, достаточно будет просто взять то, что ввёл пользователь, и "склеить" это вместе!

Формат входных данных
Два целых числа, каждое на отдельной строчке.

Формат выходных данных
Два "склеенных" числа.
"""
a = input()
b = input()
print(a+b)