"""
Округлите число 0.123456789 до K знаков после точки.

Формат входных данных
С клавиатуры вводится целое число K.

Формат выходных данных
Напечатать на экран округленное число
"""
k = int(input())
print(round(0.123456789,k))