"""
Округлите вещественное число N до двух знаков после точки.

Формат входных данных
С клавиатуры вводится вещественное число -10000 < N < 10000.

Формат выходных данных
Напечатать на экран округленное число
"""
n = float(input())
print(round(n,2))