"""
Вася купил для себя и своих друзей пачку сухариков. Определить, сможет ли Вася распределить сухарики между собой и своими друзьями таким образом, чтобы каждому досталось поровну. Сухарики ломать нельзя!

Формат входных данных
С клавиатуры вводятся два целых числа N
 и M
 – количество друзей Васи и количество сухариков в пачке.

Формат выходных данных
Вывести «YES», если сухарики можно поделить поровну между ребятами, и «NO» иначе.
"""
n = int(input()) + 1
m = int(input())

if m  // n == m  / n:
 print("YES")
else: print("NO") 