"""
«Hello, world!» — программа, результатом работы которой является вывод на экран или иное устройство фразы «Hello, world!».


Русскоязычные программисты и технические переводчики традиционно переводят слово world в его основном значении — «мир, свет, вселенная», отчего из «hello world» получается дословное «привет, мир». Объясняется такой перевод тем, что программа, начиная работу, как бы рождается и приветствует мир, в который она приходит.

Если проще, ваша программа должна вывести на экран фразу «Hello, World!» (без кавычек).
"""


print("Hello, World!")