"""
Необходимо вывести информацию в формате таблицы.
Встроенной функции для этой задачи мы не знаем, поэтому придется запрограммировать такой вывод самостоятельно. Но я уверен, что ты справишься!

Выведите в консоль информацию оформленную в таблицу, а так же замени знак вопроса названием оператора.

Язык программирования	Оператор вывода
C++	cout
PHP	echo
Python	?
"""

a="_______________________________________"
b="|Язык программирования|Оператор вывода|"
c="|---------------------|---------------|"
d="|C++                  |cout           |"
f="|---------------------|---------------|"
g="|PHP                  |echo           |"
h="|---------------------|---------------|"
y="|Python               |print          |"
u="---------------------------------------"

print(a)
print(b)
print(c)
print(d)
print(f)
print(g)
print(h)
print(y)
print(u)