"""
С клавиатуры вводятся целые числа a, b и c. 
Выведите на экран значение выражения следующего выражения:

"""
a = int(input())
b = int(input())
c = int(input())

print(a/(b+c))