"""
С клавиатуры вводятся два целых числа a и b. Напишите программу, которая вычислит и выведет на отдельных строках:

разность;

произведение;

сумму.
"""

a = int(input())
b = int(input())
print(a-b)
print(a*b)
print(a+b)