"""
С клавиатуры вводятся целые числа a и b.

Напишите программу, которая выведет на экран значение выражения  a * b – a + b.
"""
a = int(input())
b = int(input())

print(a * b - a + b)