"""
Найдите значение выражения 3⋅x−−√
.

Формат входных данных
Программа получает на вход целое число x
.

Формат выходных данных
Выведите результат выражения.
"""
import math
x = int(input())
print( 3 * math.sqrt(x))